[
  {
    "Name": "C#",
    "IconPath": "icons/skills/csharp.png",
    "Proficiency": 4,
    "Description": "Solid experience in C# with a primary focus on video game development in the Unity engine. I have extensive knowledge of design patterns (such as Singleton, Observer, and Factory) and best practices. Additionally, I have worked with the .NET environment, including projects with ASP.NET and Blazor, which allows me to create web applications like this one."
  },
  {
    "Name": "Unity",
    "IconPath": "icons/skills/unity.png",
    "Proficiency": 4,
    "Description": "Programmer with experience in the Unity engine, focused on 3D game development. I excel in programming game mechanics, creating simulators, and implementing user interface (UI) systems. I am also familiar with asset integration and modification, and I have knowledge of ShaderLab for creating visual effects and optimizing performance for mobile platforms."
  },
  {
    "Name": "Unreal",
    "IconPath": "icons/skills/unreal.png",
    "Proficiency": 3,
    "Description": "I have worked with the Unreal engine, focusing on creating 3D environments, including landscapes and platforms. I have experience in asset integration, prototyping virtual reality (VR) projects, and working with animations."
  },
  {
    "Name": "Blender",
    "IconPath": "icons/skills/blender.png",
    "Proficiency": 3,
    "Description": "I have modeled and textured in 3D using Blender, focusing on optimizing models with high polygon density and multiple materials. I have experience creating animations from scratch and integrating them directly into my video game projects."
  },
  {
    "Name": "JS/TS",
    "IconPath": "icons/skills/ts.png",
    "Proficiency": 2,
    "Description": "I have knowledge of JavaScript and TypeScript, mainly applied in the development of interactive and web experiences. I have experience working with Needle Engine within Unity and with the Three.js library for 3D web projects. Additionally, I have basic experience in creating web pages."
  },
  {
    "Name": "Git",
    "IconPath": "icons/skills/git.png",
    "Proficiency": 4,
    "Description": "I have experience using Git for both individual and team projects, demonstrating a solid understanding of version control workflows. I strategically use commits and tags as checkpoints to manage the code history. I have worked with platforms like GitHub and GitLab for collaboration and project deployment."
  },
  {
    "Name": "Photoshop",
    "IconPath": "icons/skills/photoshop.png",
    "Proficiency": 3,
    "Description": "Basic knowledge of Adobe Photoshop for image editing, resizing, and adaptation for different platforms. I have experience creating user interface (UI) elements, such as text, for implementation in projects."
  }
]
